src/bsl/Catalogs/гкс_ПродукцияWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_ПродукцияWarehouse</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКороткоеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWarehouse</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовWarehouse</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Показатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сюрвейер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элеватор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/гкс_ПродукцияWarehouse/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные справочника из Warehouse
//
Процедура ОбновитьДанныеССервера() Экспорт

	МассивДанных = ПолучитьПродукциюПоAPI();
	ТипОбъекта = Перечисления.гкс_ТипыОбъектовWarehouse.Продукция;

	Для Каждого ДанныеWarehouse Из МассивДанных Цикл

		ДанныеЗаполнения = ИнициализироватьСтруктураНовогоЭлемента();
		ПодготовитьЗаполнениеПродукции(ДанныеЗаполнения, ДанныеWarehouse);
		ПродукцияСсылка	= ПродукцияПоИдентификатору(ДанныеЗаполнения.ИдентификаторWarehouse);

		Если Не ЗначениеЗаполнено(ПродукцияСсылка) Тогда
			ПродукцияСсылка = НовыйЭлемент(ДанныеЗаполнения);
		Иначе
			ПерезаполнитьПродукциюИЗаписать(ДанныеЗаполнения, ПродукцияСсылка);
		КонецЕсли;

		гкс_ИнтеграцияWarehouse.ДобавитьВИдентификаторыСинхронизируемыхОбъектов(
			ДанныеЗаполнения, ПродукцияСсылка, ТипОбъекта);

	КонецЦикла;

КонецПроцедуры

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт

	Возврат "ИдентификаторWarehouse";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПродукциюПоAPI()

	Сервис = Справочники.гкс_РесурсыВебСервисов.Goods;
	ИмяСобытия = ИмяСобытияПолучитьПродукцию();

	Возврат гкс_ИнтеграцияWarehouse.ВыполнитьHTTPЗапросИПрочитатьJSON(Сервис, ИмяСобытия);

КонецФункции

// Создает новый элемент справочника, заполняет по переданному параметру, записывает.
//
// Параметры:
//  ДанныеЗаполнения - см. ИнициализироватьСтруктураНовогоЭлемента()
//
Функция НовыйЭлемент(ДанныеЗаполнения) Экспорт

	Продукция = СоздатьЭлемент();
	Продукция.Заполнить(ДанныеЗаполнения);

	Попытка
		Продукция.Записать();
	Исключение
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ЗаписьЖурналаРегистрации("ИнтеграцияWarehouse.ПолучитьКачественныеПоказатели",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.Справочники.гкс_ПоказателиКачестваWarehouse,
		                         Неопределено,
		                         Комментарий);

		ИсключениеОшибкаСозданияНовогоЭлемента(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Продукция.Ссылка;

КонецФункции

// Ищет элемент справочника по реквизиту "ИдентификаторWarehouse".
//
// Параметры:
//  Идентификатор - Строка - идентификатор Warehouse
//
Функция ПродукцияПоИдентификатору(Идентификатор) Экспорт

	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторWarehouse", Идентификатор);
	Запрос.Текст 	=
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПродукцияWarehouse.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.гкс_ПродукцияWarehouse КАК ПродукцияWarehouse
		|ГДЕ
		|	ПродукцияWarehouse.ИдентификаторWarehouse = &ИдентификаторWarehouse";

	РезультатЗапроса 	= Запрос.Выполнить();
	Выборка 			= РезультатЗапроса.Выбрать();

	ПродукцияСсылка 	= ПустаяСсылка();

	Если Выборка.Следующий() Тогда
		ПродукцияСсылка = Выборка.Ссылка;
	КонецЕсли;

	Возврат ПродукцияСсылка;

КонецФункции

Процедура ПодготовитьЗаполнениеПродукции(ДанныеЗаполнения, ДанныеПродукции)

	РеквизитыШапкиВСервисе 	= СоответствиеРеквизитовПродукции();

	Для Каждого КлючИЗначение Из ДанныеПродукции Цикл

		Если гкс_ИнтеграцияWarehouse.НайтиРеквизитШапки(КлючИЗначение, РеквизитыШапкиВСервисе) Тогда

			ЗаполнитьРеквизитШапкиПродукции(ДанныеЗаполнения, КлючИЗначение, РеквизитыШапкиВСервисе);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПерезаполнитьПродукциюИЗаписать(ДанныеЗаполнения, ПродукцияСсылка)

	ОбъектПродукция 	= ПродукцияСсылка.ПолучитьОбъект();

	ЗаполнитьЗначенияСвойств(ОбъектПродукция, ДанныеЗаполнения);

	ОбъектПродукция.Записать();

КонецПроцедуры

Процедура ЗаполнитьРеквизитШапкиПродукции(ДанныеЗаполнения, КлючИЗначение, РеквизитыШапкиВСервисе)

	ИмяРеквизита = РеквизитыШапкиВСервисе.Получить(КлючИЗначение.Ключ);

	ДанныеЗаполнения[ИмяРеквизита] = КлючИЗначение.Значение;

КонецПроцедуры

Функция СоответствиеРеквизитовПродукции()

	НаименованияВСервисе = Новый Соответствие;
	НаименованияВСервисе.Вставить("name", 									"Наименование");
	НаименованияВСервисе.Вставить("shortName", 								"НаименованиеКороткое");
	НаименованияВСервисе.Вставить("name_en", 								"НаименованиеEN");
	НаименованияВСервисе.Вставить("shortName_en", 							"НаименованиеКороткоеEN");
	НаименованияВСервисе.Вставить("normativeDocumentForSampling", 			"НормативныйДокумент");
	НаименованияВСервисе.Вставить("id", 									"ИдентификаторWarehouse");

	Возврат НаименованияВСервисе;

КонецФункции

Функция ИмяСобытияПолучитьПродукцию()

	Возврат "ИнтеграцияWarehouse.ПолучитьПродукцию";

КонецФункции

// Возвращает структуру элемента справочника.
//
// Возвращаемое значение:
//  Структура - содержит все реквизиты справочника:
// 		* Наименование - Строка - имя показателя
// 		* НаименованиеКороткое - Строка - имя показателя
// 		* ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения -
// 		* Стандарт - Строка - способ измерения
// 		* Точность - Число - точность измерения
// 		* ЗависимыйПоказатель - СправочникСсылка.гкс_ПоказателиКачестваWarehouse - связанный показатель
// 		* ВерхнийПределЗависимогоПоказателя - Число - пределы
// 		* НижнийПределЗависимогоПоказателя - Число - пределы
// 		* КодWarehouse - Строка - код справочного элемента в веб-сервесе
// 		* ИдентификаторWarehouse - Строка - УИД в веб-сервесе
//
Функция ИнициализироватьСтруктураНовогоЭлемента() Экспорт

	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование", 						"");
	СтруктураЗаполнения.Вставить("НаименованиеКороткое", 				"");
	СтруктураЗаполнения.Вставить("НаименованиеEN", 						"");
	СтруктураЗаполнения.Вставить("НаименованиеКороткоеEN", 				"");
	СтруктураЗаполнения.Вставить("НормативныйДокумент", 				"");
	СтруктураЗаполнения.Вставить("ИдентификаторWarehouse", 				"");

	Возврат СтруктураЗаполнения;

КонецФункции

Процедура ИсключениеОшибкаСозданияНовогоЭлемента(ПодробноеПредставлениеОшибки)

	ТекстОшибки =
	    СтрШаблон(НСтр("ru = 'Ошибка создания нового элемента справочника ""Продукция Warehouse"".%1%2'"),
	    "|",
	    ПодробноеПредставлениеОшибки);

	ВызватьИсключение ТекстОшибки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
